tutorial.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Storybook Tutorial</title>
<meta name="author" content="(Tamara Temple)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="./reveal.js/css/theme/moon.css" id="theme"/>


<!-- If the query includes 'print-pdf', include the PDF print sheet -->
<meta name="description" content="Storybook Tutorial">
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Storybook Tutorial</h1><h2 class="author">Tamara Temple</h2><p class="date">Created: 2018-10-16 Tue 21:55</p>
</section>
<style media="screen">
@import url("https://fonts.googleapis.com/css?family=Montserrat:700,700i");
.reveal h1,.reveal h2,.reveal h3,.reveal h4,.reveal h5,.reveal h6 {
text-transform: inherit; font-family: "Monserrat", sans-serif; font-weight: bold;
}

@import url("https://fonts.googleapis.com/css?family=Lato:400,400i");
.reveal section. .reveal div, .reveal p, .reveal ul, .reveal ol, .reveal li, .reveal dl, .reveal dt, .reveal dd,
.reveal blockquote, .reveal q, .reveal aside, .reveal figure, .reveal figcaption, .reveal article, .reveal header,
.reveal footer, .reveal span, .reveal i, .reveal b, .reveal em, .reveal strong {
font-family: "Lato", sans-serif;
}
.reveal .slide-number { color: white; }
</style>

<section>
<section id="slide-org9eab142">
<h2 id="org9eab142">Introduction</h2>
<p>
Storybook Tutorial
</p>

</section>
<section id="slide-orgb5b8756">
<h3 id="orgb5b8756">who am I</h3>
<ul>
<li class="fragment fade-in">Tamara Temple</li>
<li class="fragment fade-in">github: tamouse</li>
<li class="fragment fade-in">Software developer for a (very) long time.</li>
<li class="fragment fade-in">Primary focus on back-end development for past 20 years.</li>
<li class="fragment fade-in">React development since middle of 2017</li>
<li class="fragment fade-in">nearly full-time</li>
<li class="fragment fade-in">still do back-end Rails + GraphQL server work</li>

</ul>


</section>
<section id="slide-org06dc97c">
<h3 id="org06dc97c">what is storybook?</h3>
<ul>
<li class="fragment fade-in">UI development environment for UI components</li>
<li class="fragment fade-in">visualize different states of your UI components</li>
<li class="fragment fade-in">develop them interactively</li>
<li class="fragment fade-in">runs outside of your app</li>
<li class="fragment fade-in">develop UI components in isolation</li>
<li class="fragment fade-in">without app-specific dependencies and requirements</li>

</ul>


</section>
</section>
<section>
<section id="slide-orgf94e6ad">
<h2 id="orgf94e6ad">Quick Setup and Go</h2>
<p>
Start with your existing react app
</p>

<div class="org-src-container">

<pre  class="src src-shell-script"><span style="color: #ffaa00;">cd</span> path/to/project
</pre>
</div>

</section>
<section id="slide-org788037b">
<h3 id="org788037b">Install the storybook cli script globally</h3>
<div class="org-src-container">

<pre  class="src src-shell-script">npm install -g @storybook/cli

<span style="color: #ff0000;"># </span><span style="color: #ff0000;">- or -</span>

yarn global add @storybook/cli
</pre>
</div>

</section>
<section id="slide-org5610543">
<h3 id="org5610543">Add it to your project</h3>
<div class="org-src-container">

<pre  class="src src-shell-script">getstorybook
</pre>
</div>

</section>
<section id="slide-orgc6574d5">
<h3 id="orgc6574d5">Start compiling stories</h3>
<div class="org-src-container">

<pre  class="src src-shell-script">npm run storybook

<span style="color: #ff0000;"># </span><span style="color: #ff0000;">-or-</span>

yarn storybook
</pre>
</div>
</section>
</section>
<section>
<section id="slide-orgc681aa5">
<h2 id="orgc681aa5">Slow Setup</h2>
<div class="outline-text-2" id="text-orgc681aa5">
</div>
</section>
<section id="slide-org34be4a8">
<h3 id="org34be4a8">Add storybook to your project</h3>
<p>
After creating your react app, add storybook for react:
</p>

<div class="org-src-container">

<pre  class="src src-shell-script">yarn add @storybook/react
</pre>
</div>

</section>
<section id="slide-org9b14298">
<h3 id="org9b14298">Configure storybook</h3>
<p>
Create the configuration directory and files:
</p>

<div class="org-src-container">

<pre  class="src src-shell-script">mkdir .storybook
touch .storybook/config.js
</pre>
</div>

</section>
<section id="slide-orga141eae">
<h4 id="orga141eae">decide how you want to organize stories</h4>
<p>
This is how storybook finds stories.
</p>

<ul>
<li>the quick way: load stories from a single directory</li>
<li>the react way (?): stories next to components</li>

</ul>

</section>
<section id="slide-org66dc058">
<h4 id="org66dc058">project structure</h4>
<pre  class="example">
&lt;project_root&gt;/
  .storybook/
    config.js
  src/
    index.js
    App.js
    App.test.js
    App.story.js
</pre>

</section>
<section id="slide-org2132fcd">
<h4 id="org2132fcd">load stories via webpack's require.context()</h4>
<ul>
<li class="fragment fade-in">allows you to require files</li>
<li class="fragment fade-in">matches a pattern</li>
<li class="fragment fade-in">optionally recursing a directory</li>
<li class="fragment fade-in">See: <a href="https://webpack.js.org/guides/dependency-management/#require-context">https://webpack.js.org/guides/dependency-management/#require-context</a></li>

</ul>

</section>
<section >

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #ff0000;">// </span><span style="color: #ff0000;">.storybook/config.js</span>
<span style="color: #00ffff;">import</span> { configure } from <span style="color: #ffff00;">'@storybook/react'</span>;

<span style="color: #00ffff;">function</span> <span style="color: #4186be;">importAll</span>(<span style="color: #ffffff; font-weight: bold;">req</span>) {
  req.keys().forEach(filename =&gt; req(filename));
}

<span style="color: #00ffff;">function</span> <span style="color: #4186be;">loadStories</span>() {
  <span style="color: #00ffff;">let</span> <span style="color: #ffffff; font-weight: bold;">req</span>;
  req = require.context(<span style="color: #ffff00;">'../src'</span>, <span style="color: #00ff00;">true</span>, <span style="color: #ffff00;">/\.story\.js$/</span>);
  importAll(req);
}

configure(loadStories, module);
</pre>
</div>

</section>
<section id="slide-org2cc6e40">
<h3 id="org2cc6e40">Write stories</h3>
<p>
Let's write the story for the main React App component
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #ff0000;">// </span><span style="color: #ff0000;">src/App.story.js</span>
<span style="color: #00ffff;">import</span> React from <span style="color: #ffff00;">"react"</span>;
<span style="color: #00ffff;">import</span> { storiesOf } from <span style="color: #ffff00;">"@storybook/react"</span>;
<span style="color: #00ffff;">import</span> App from <span style="color: #ffff00;">"./App"</span>;

storiesOf(<span style="color: #ffff00;">"Main React App"</span>, module).add(<span style="color: #ffff00;">"the app"</span>, () =&gt; &lt;App /&gt;);
</pre>
</div>

</section>
<section id="slide-orgce46dd1">
<h3 id="orgce46dd1">Run storybook</h3>
<p>
Add a script to <code>package.json</code> to run storybook
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #ffff00;">"scripts"</span>: {
  <span style="color: #ffff00;">"start"</span>: <span style="color: #ffff00;">"react-scripts start"</span>,
  <span style="color: #ffff00;">"build"</span>: <span style="color: #ffff00;">"react-scripts build"</span>,
  <span style="color: #ffff00;">"test"</span>: <span style="color: #ffff00;">"react-scripts test"</span>,
  <span style="color: #ffff00;">"eject"</span>: <span style="color: #ffff00;">"react-scripts eject"</span>,
  <span style="color: #ffff00;">"storybook"</span>: <span style="color: #ffff00;">"start-storybook -p 9009 -c .storybook"</span>
},
</pre>
</div>

</section>
<section >

<p>
Run the script and open your browser to <code>http://localhost:9009</code>
</p>

<div class="org-src-container">

<pre  class="src src-shell-script">yarn run storybook

<span style="color: #ff0000;"># </span><span style="color: #ff0000;">or just</span>

yarn storybook
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org51294f0">
<h2 id="org51294f0">Basic usage</h2>
<div class="outline-text-2" id="text-org51294f0">
</div>
</section>
<section id="slide-orge7be168">
<h3 id="orge7be168">A simple component</h3>
<p>
Let's build a simple horizontal input field component.
</p>

<p>
This will be wrapped in a form in the application
</p>

</section>
<section >

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #00ffff;">export</span> <span style="color: #00ffff;">class</span> HorizontalInputField <span style="color: #00ffff;">extends</span> React.Component {
  render() {
    <span style="color: #00ffff;">const</span> { id, label, name, onChange } = <span style="color: #00ff00;">this</span>.props;
    <span style="color: #00ffff;">return</span> (
      &lt;FormGroup&gt;
        &lt;label <span style="color: #00ffff;">for</span>={name}&gt;{label}&lt;/label&gt;
        &lt;input
          className=<span style="color: #ffff00;">"form-control"</span>
          id={id}
          type=<span style="color: #ffff00;">"text"</span>
          name={name}
          onChange={onChange}
        /&gt;
      &lt;/FormGroup&gt;
    );
  }
}
</pre>
</div>

</section>
<section id="slide-org835a8da">
<h3 id="org835a8da">A simple set of stories</h3>
<p>
The corresponding story wraps the component to display it properly
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #00ffff;">import</span> HorizontalInputField from <span style="color: #ffff00;">"./index"</span>;
storiesOf(<span style="color: #ffff00;">"components/HorizontalInputField"</span>, module)
  .add(<span style="color: #ffff00;">"basic example"</span>, () =&gt; (
    &lt;Wrapper&gt;
      &lt;Form&gt;
        &lt;HorizontalInputField
          id=<span style="color: #ffff00;">"email-input-field"</span>
          name=<span style="color: #ffff00;">"email"</span>
          label=<span style="color: #ffff00;">"Email:"</span>
          onChange={noop}
        /&gt;
      &lt;/Form&gt;
    &lt;/Wrapper&gt;
 ));
</pre>
</div>

</section>
</section>
<section>
<section id="slide-org494c844">
<h2 id="org494c844">Extending stories using addons</h2>
<p>
Besides the aforementioned <code>actions</code> addon, storybook has many other <b>addons</b>:
</p>

<p>
<a href="https://storybook.js.org/addons/addon-gallery/">https://storybook.js.org/addons/addon-gallery/</a>
</p>

</section>
<section id="slide-org1523978">
<h3 id="org1523978">Small set I've used:</h3>
<ul>
<li><b>Actions</b>: event "inspector"</li>
<li><b>Apollo</b>: a mock Apollo Client provider</li>
<li><b>Storybook-router</b>: router providers for React and Vue</li>

</ul>

</section>
</section>
<section>
<section id="slide-org26cc524">
<h2 id="org26cc524">Actions Addon</h2>
<div class="outline-text-2" id="text-org26cc524">
</div>
</section>
<section id="slide-org577d4c3">
<h3 id="org577d4c3">Install the addon</h3>
<div class="org-src-container">

<pre  class="src src-shell-script">yarn add @storybook/addon-actions
</pre>
</div>

</section>
<section id="slide-org2251b59">
<h3 id="org2251b59">Add to configuration</h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #ff0000;">// </span><span style="color: #ff0000;">.storybook/addons.js</span>
<span style="color: #00ffff;">import</span> <span style="color: #ffff00;">"@storybook/addons/register"</span>
</pre>
</div>

</section>
<section id="slide-orgc36f27a">
<h3 id="orgc36f27a">Add them to your story</h3>
<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #ff0000;">// </span><span style="color: #ff0000;">...</span>
<span style="color: #00ffff;">import</span> { action } from <span style="color: #ffff00;">"@storybook/addon-actions/register"</span>
<span style="color: #ff0000;">// </span><span style="color: #ff0000;">...</span>

storiesOf(<span style="color: #ffff00;">"components/HorizontalInputField"</span>, module)
  .add(<span style="color: #ffff00;">"basic example"</span>, () =&gt; (
    &lt;Wrapper&gt;
      &lt;Form&gt;
        &lt;HorizontalInputField
          id=<span style="color: #ffff00;">"email-input-field"</span>
          name=<span style="color: #ffff00;">"email"</span>
          label=<span style="color: #ffff00;">"Email:"</span>
          onChange={action(<span style="color: #ffff00;">"email field changed"</span>)}
        /&gt;
      &lt;/Form&gt;
    &lt;/Wrapper&gt;
 ));
</pre>
</div>

</section>
<section id="slide-org8755436">
<h3 id="org8755436">See the events as they trigger</h3>
<p>
Every time the input field changes, an event is shown in the "Action Logger" area
</p>


</section>
</section>
<section>
<section id="slide-org46d44ea">
<h2 id="org46d44ea">Tips</h2>
<div class="outline-text-2" id="text-org46d44ea">
</div>
</section>
<section id="slide-orgf80424f">
<h3 id="orgf80424f">Organizing stories</h3>
<div class="outline-text-3" id="text-orgf80424f">
</div>
</section>
<section id="slide-orgd508efa">
<h4 id="orgd508efa">Follow the same organizing principles you use with tests</h4>
<ul>
<li>in separate tree</li>
<li>alongside component</li>

</ul>

</section>
<section id="slide-org177a532">
<h4 id="org177a532">Share test data</h4>
<p>
Reuse test data from your specs by organizing it to share
</p>


</section>
<section id="slide-org2e58ddf">
<h3 id="org2e58ddf">use a Consumer</h3>
<ul>
<li>keep stories light</li>
<li>common elements to present the story</li>

</ul>

</section>
<section >

<p>
Example:
</p>

<div class="org-src-container">

<pre  class="src src-javascript"><span style="color: #00ffff;">class</span> Consumer <span style="color: #00ffff;">extends</span> React.Component {
  render() {
    &lt;Component {...<span style="color: #00ff00;">this</span>.props} /&gt;
  }
}

storiesOf(<span style="color: #ffff00;">"Component"</span>, module)
  .add(<span style="color: #ffff00;">"example one"</span>, () =&gt; (&lt;Consumer thing=<span style="color: #ffff00;">"one"</span> /&gt; ))
  .add(<span style="color: #ffff00;">"example two"</span>, () =&gt; (&lt;Consumer thing=<span style="color: #ffff00;">"two"</span> /&gt; ))
</pre>
</div>

</section>
<section id="slide-org84e13ba">
<h3 id="org84e13ba">using jsdoc and markup</h3>
<p>
Extract and display in story
</p>

</section>
<section id="slide-org75471f6">
<h3 id="org75471f6">generators</h3>
<p>
Create component, spec, and story boilerplate
</p>

</section>
</section>
<section>
<section id="slide-orgca50d6f">
<h2 id="orgca50d6f">@me</h2>
<ul>
<li>Tamara Temple</li>
<li>github: tamouse</li>
<li>twitter: @tamouse</li>

</ul>
</section>
</section>
</div>
</div>
<div> Created by Tamara Temple &lt;tamara@tamouse.org&gt; </div>
<script src="./reveal.js/lib/js/head.min.js"></script>
<script src="./reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: true,
center: true,
slideNumber: 'c',
rollingLinks: true,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'none', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: './reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
